Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/pac.h
/*
 * Component description for PAC
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-28T20:38:26Z */
#ifndef _PIC32CZCA90_PAC_COMPONENT_H_
#define _PIC32CZCA90_PAC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PAC                                          */
/* ************************************************************************** */

/* -------- PAC_WRCTRL : (PAC Offset: 0x00) (R/W 32) Write control -------- */
#define PAC_WRCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (PAC_WRCTRL) Write control  Reset Value */

#define PAC_WRCTRL_PERID_Pos                  _UINT32_(0)                                          /* (PAC_WRCTRL) Peripheral identifier Position */
#define PAC_WRCTRL_PERID_Msk                  (_UINT32_(0xFFFF) << PAC_WRCTRL_PERID_Pos)           /* (PAC_WRCTRL) Peripheral identifier Mask */
#define PAC_WRCTRL_PERID(value)               (PAC_WRCTRL_PERID_Msk & (_UINT32_(value) << PAC_WRCTRL_PERID_Pos)) /* Assigment of value for PERID in the PAC_WRCTRL register */
#define PAC_WRCTRL_KEY_Pos                    _UINT32_(16)                                         /* (PAC_WRCTRL) Peripheral access control key Position */
#define PAC_WRCTRL_KEY_Msk                    (_UINT32_(0xFF) << PAC_WRCTRL_KEY_Pos)               /* (PAC_WRCTRL) Peripheral access control key Mask */
#define PAC_WRCTRL_KEY(value)                 (PAC_WRCTRL_KEY_Msk & (_UINT32_(value) << PAC_WRCTRL_KEY_Pos)) /* Assigment of value for KEY in the PAC_WRCTRL register */
#define   PAC_WRCTRL_KEY_OFF_Val              _UINT32_(0x0)                                        /* (PAC_WRCTRL) No action  */
#define   PAC_WRCTRL_KEY_CLR_Val              _UINT32_(0x1)                                        /* (PAC_WRCTRL) Clear protection  */
#define   PAC_WRCTRL_KEY_SET_Val              _UINT32_(0x2)                                        /* (PAC_WRCTRL) Set protection  */
#define   PAC_WRCTRL_KEY_SETLCK_Val           _UINT32_(0x3)                                        /* (PAC_WRCTRL) Set and lock protection  */
#define PAC_WRCTRL_KEY_OFF                    (PAC_WRCTRL_KEY_OFF_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) No action Position  */
#define PAC_WRCTRL_KEY_CLR                    (PAC_WRCTRL_KEY_CLR_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) Clear protection Position  */
#define PAC_WRCTRL_KEY_SET                    (PAC_WRCTRL_KEY_SET_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) Set protection Position  */
#define PAC_WRCTRL_KEY_SETLCK                 (PAC_WRCTRL_KEY_SETLCK_Val << PAC_WRCTRL_KEY_Pos)    /* (PAC_WRCTRL) Set and lock protection Position  */
#define PAC_WRCTRL_Msk                        _UINT32_(0x00FFFFFF)                                 /* (PAC_WRCTRL) Register Mask  */


/* -------- PAC_EVCTRL : (PAC Offset: 0x04) (R/W 8) Event control -------- */
#define PAC_EVCTRL_RESETVALUE                 _UINT8_(0x00)                                        /*  (PAC_EVCTRL) Event control  Reset Value */

#define PAC_EVCTRL_ERREO_Pos                  _UINT8_(0)                                           /* (PAC_EVCTRL) Peripheral acess error event output Position */
#define PAC_EVCTRL_ERREO_Msk                  (_UINT8_(0x1) << PAC_EVCTRL_ERREO_Pos)               /* (PAC_EVCTRL) Peripheral acess error event output Mask */
#define PAC_EVCTRL_ERREO(value)               (PAC_EVCTRL_ERREO_Msk & (_UINT8_(value) << PAC_EVCTRL_ERREO_Pos)) /* Assigment of value for ERREO in the PAC_EVCTRL register */
#define PAC_EVCTRL_Msk                        _UINT8_(0x01)                                        /* (PAC_EVCTRL) Register Mask  */


/* -------- PAC_INTENCLR : (PAC Offset: 0x08) (R/W 8) Interrupt enable clear -------- */
#define PAC_INTENCLR_RESETVALUE               _UINT8_(0x00)                                        /*  (PAC_INTENCLR) Interrupt enable clear  Reset Value */

#define PAC_INTENCLR_ERR_Pos                  _UINT8_(0)                                           /* (PAC_INTENCLR) Peripheral access error interrupt disable Position */
#define PAC_INTENCLR_ERR_Msk                  (_UINT8_(0x1) << PAC_INTENCLR_ERR_Pos)               /* (PAC_INTENCLR) Peripheral access error interrupt disable Mask */
#define PAC_INTENCLR_ERR(value)               (PAC_INTENCLR_ERR_Msk & (_UINT8_(value) << PAC_INTENCLR_ERR_Pos)) /* Assigment of value for ERR in the PAC_INTENCLR register */
#define PAC_INTENCLR_Msk                      _UINT8_(0x01)                                        /* (PAC_INTENCLR) Register Mask  */


/* -------- PAC_INTENSET : (PAC Offset: 0x09) (R/W 8) Interrupt enable set -------- */
#define PAC_INTENSET_RESETVALUE               _UINT8_(0x00)                                        /*  (PAC_INTENSET) Interrupt enable set  Reset Value */

#define PAC_INTENSET_ERR_Pos                  _UINT8_(0)                                           /* (PAC_INTENSET) Peripheral access error interrupt enable Position */
#define PAC_INTENSET_ERR_Msk                  (_UINT8_(0x1) << PAC_INTENSET_ERR_Pos)               /* (PAC_INTENSET) Peripheral access error interrupt enable Mask */
#define PAC_INTENSET_ERR(value)               (PAC_INTENSET_ERR_Msk & (_UINT8_(value) << PAC_INTENSET_ERR_Pos)) /* Assigment of value for ERR in the PAC_INTENSET register */
#define PAC_INTENSET_Msk                      _UINT8_(0x01)                                        /* (PAC_INTENSET) Register Mask  */


/* -------- PAC_INTFLAGAHB : (PAC Offset: 0x10) (R/W 32) Bridge interrupt flag status -------- */
#define PAC_INTFLAGAHB_RESETVALUE             _UINT32_(0x00)                                       /*  (PAC_INTFLAGAHB) Bridge interrupt flag status  Reset Value */

#define PAC_INTFLAGAHB_Msk                    _UINT32_(0x00000000)                                 /* (PAC_INTFLAGAHB) Register Mask  */


/* -------- PAC_INTFLAGA : (PAC Offset: 0x14) (R/W 32) Peripheral interrupt flag status - Bridge A -------- */
#define PAC_INTFLAGA_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A  Reset Value */

#define PAC_INTFLAGA_DSU_Pos                  _UINT32_(0)                                          /* (PAC_INTFLAGA) DSU Position */
#define PAC_INTFLAGA_DSU_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_DSU_Pos)              /* (PAC_INTFLAGA) DSU Mask */
#define PAC_INTFLAGA_DSU(value)               (PAC_INTFLAGA_DSU_Msk & (_UINT32_(value) << PAC_INTFLAGA_DSU_Pos)) /* Assigment of value for DSU in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_FCW_Pos                  _UINT32_(1)                                          /* (PAC_INTFLAGA) FCW Position */
#define PAC_INTFLAGA_FCW_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_FCW_Pos)              /* (PAC_INTFLAGA) FCW Mask */
#define PAC_INTFLAGA_FCW(value)               (PAC_INTFLAGA_FCW_Msk & (_UINT32_(value) << PAC_INTFLAGA_FCW_Pos)) /* Assigment of value for FCW in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_FCR_Pos                  _UINT32_(2)                                          /* (PAC_INTFLAGA) FCR Position */
#define PAC_INTFLAGA_FCR_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_FCR_Pos)              /* (PAC_INTFLAGA) FCR Mask */
#define PAC_INTFLAGA_FCR(value)               (PAC_INTFLAGA_FCR_Msk & (_UINT32_(value) << PAC_INTFLAGA_FCR_Pos)) /* Assigment of value for FCR in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_PM_Pos                   _UINT32_(3)                                          /* (PAC_INTFLAGA) PM Position */
#define PAC_INTFLAGA_PM_Msk                   (_UINT32_(0x1) << PAC_INTFLAGA_PM_Pos)               /* (PAC_INTFLAGA) PM Mask */
#define PAC_INTFLAGA_PM(value)                (PAC_INTFLAGA_PM_Msk & (_UINT32_(value) << PAC_INTFLAGA_PM_Pos)) /* Assigment of value for PM in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SUPC_Pos                 _UINT32_(4)                                          /* (PAC_INTFLAGA) SUPC Position */
#define PAC_INTFLAGA_SUPC_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_SUPC_Pos)             /* (PAC_INTFLAGA) SUPC Mask */
#define PAC_INTFLAGA_SUPC(value)              (PAC_INTFLAGA_SUPC_Msk & (_UINT32_(value) << PAC_INTFLAGA_SUPC_Pos)) /* Assigment of value for SUPC in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_RSTC_Pos                 _UINT32_(5)                                          /* (PAC_INTFLAGA) RSTC Position */
#define PAC_INTFLAGA_RSTC_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_RSTC_Pos)             /* (PAC_INTFLAGA) RSTC Mask */
#define PAC_INTFLAGA_RSTC(value)              (PAC_INTFLAGA_RSTC_Msk & (_UINT32_(value) << PAC_INTFLAGA_RSTC_Pos)) /* Assigment of value for RSTC in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_OSCCTRL_Pos              _UINT32_(6)                                          /* (PAC_INTFLAGA) OSCCTRL Position */
#define PAC_INTFLAGA_OSCCTRL_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_OSCCTRL_Pos)          /* (PAC_INTFLAGA) OSCCTRL Mask */
#define PAC_INTFLAGA_OSCCTRL(value)           (PAC_INTFLAGA_OSCCTRL_Msk & (_UINT32_(value) << PAC_INTFLAGA_OSCCTRL_Pos)) /* Assigment of value for OSCCTRL in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_OSC32KCTRL_Pos           _UINT32_(7)                                          /* (PAC_INTFLAGA) OSC32KCTRL Position */
#define PAC_INTFLAGA_OSC32KCTRL_Msk           (_UINT32_(0x1) << PAC_INTFLAGA_OSC32KCTRL_Pos)       /* (PAC_INTFLAGA) OSC32KCTRL Mask */
#define PAC_INTFLAGA_OSC32KCTRL(value)        (PAC_INTFLAGA_OSC32KCTRL_Msk & (_UINT32_(value) << PAC_INTFLAGA_OSC32KCTRL_Pos)) /* Assigment of value for OSC32KCTRL in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_GCLK_Pos                 _UINT32_(8)                                          /* (PAC_INTFLAGA) GCLK Position */
#define PAC_INTFLAGA_GCLK_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_GCLK_Pos)             /* (PAC_INTFLAGA) GCLK Mask */
#define PAC_INTFLAGA_GCLK(value)              (PAC_INTFLAGA_GCLK_Msk & (_UINT32_(value) << PAC_INTFLAGA_GCLK_Pos)) /* Assigment of value for GCLK in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_MCLK_Pos                 _UINT32_(9)                                          /* (PAC_INTFLAGA) MCLK Position */
#define PAC_INTFLAGA_MCLK_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_MCLK_Pos)             /* (PAC_INTFLAGA) MCLK Mask */
#define PAC_INTFLAGA_MCLK(value)              (PAC_INTFLAGA_MCLK_Msk & (_UINT32_(value) << PAC_INTFLAGA_MCLK_Pos)) /* Assigment of value for MCLK in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_FREQM_Pos                _UINT32_(10)                                         /* (PAC_INTFLAGA) FREQM Position */
#define PAC_INTFLAGA_FREQM_Msk                (_UINT32_(0x1) << PAC_INTFLAGA_FREQM_Pos)            /* (PAC_INTFLAGA) FREQM Mask */
#define PAC_INTFLAGA_FREQM(value)             (PAC_INTFLAGA_FREQM_Msk & (_UINT32_(value) << PAC_INTFLAGA_FREQM_Pos)) /* Assigment of value for FREQM in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_WDT_Pos                  _UINT32_(11)                                         /* (PAC_INTFLAGA) WDT Position */
#define PAC_INTFLAGA_WDT_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_WDT_Pos)              /* (PAC_INTFLAGA) WDT Mask */
#define PAC_INTFLAGA_WDT(value)               (PAC_INTFLAGA_WDT_Msk & (_UINT32_(value) << PAC_INTFLAGA_WDT_Pos)) /* Assigment of value for WDT in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_RTC_Pos                  _UINT32_(12)                                         /* (PAC_INTFLAGA) RTC Position */
#define PAC_INTFLAGA_RTC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_RTC_Pos)              /* (PAC_INTFLAGA) RTC Mask */
#define PAC_INTFLAGA_RTC(value)               (PAC_INTFLAGA_RTC_Msk & (_UINT32_(value) << PAC_INTFLAGA_RTC_Pos)) /* Assigment of value for RTC in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_EIC_Pos                  _UINT32_(13)                                         /* (PAC_INTFLAGA) EIC Position */
#define PAC_INTFLAGA_EIC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_EIC_Pos)              /* (PAC_INTFLAGA) EIC Mask */
#define PAC_INTFLAGA_EIC(value)               (PAC_INTFLAGA_EIC_Msk & (_UINT32_(value) << PAC_INTFLAGA_EIC_Pos)) /* Assigment of value for EIC in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_PAC_Pos                  _UINT32_(14)                                         /* (PAC_INTFLAGA) PAC Position */
#define PAC_INTFLAGA_PAC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_PAC_Pos)              /* (PAC_INTFLAGA) PAC Mask */
#define PAC_INTFLAGA_PAC(value)               (PAC_INTFLAGA_PAC_Msk & (_UINT32_(value) << PAC_INTFLAGA_PAC_Pos)) /* Assigment of value for PAC in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_DRMTCM_Pos               _UINT32_(15)                                         /* (PAC_INTFLAGA) DRMTCM Position */
#define PAC_INTFLAGA_DRMTCM_Msk               (_UINT32_(0x1) << PAC_INTFLAGA_DRMTCM_Pos)           /* (PAC_INTFLAGA) DRMTCM Mask */
#define PAC_INTFLAGA_DRMTCM(value)            (PAC_INTFLAGA_DRMTCM_Msk & (_UINT32_(value) << PAC_INTFLAGA_DRMTCM_Pos)) /* Assigment of value for DRMTCM in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_MCRAMC_Pos               _UINT32_(16)                                         /* (PAC_INTFLAGA) MCRAMC Position */
#define PAC_INTFLAGA_MCRAMC_Msk               (_UINT32_(0x1) << PAC_INTFLAGA_MCRAMC_Pos)           /* (PAC_INTFLAGA) MCRAMC Mask */
#define PAC_INTFLAGA_MCRAMC(value)            (PAC_INTFLAGA_MCRAMC_Msk & (_UINT32_(value) << PAC_INTFLAGA_MCRAMC_Pos)) /* Assigment of value for MCRAMC in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_TRAM_Pos                 _UINT32_(17)                                         /* (PAC_INTFLAGA) TRAM Position */
#define PAC_INTFLAGA_TRAM_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_TRAM_Pos)             /* (PAC_INTFLAGA) TRAM Mask */
#define PAC_INTFLAGA_TRAM(value)              (PAC_INTFLAGA_TRAM_Msk & (_UINT32_(value) << PAC_INTFLAGA_TRAM_Pos)) /* Assigment of value for TRAM in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_PORT_Pos                 _UINT32_(18)                                         /* (PAC_INTFLAGA) PORT Position */
#define PAC_INTFLAGA_PORT_Msk                 (_UINT32_(0x1) << PAC_INTFLAGA_PORT_Pos)             /* (PAC_INTFLAGA) PORT Mask */
#define PAC_INTFLAGA_PORT(value)              (PAC_INTFLAGA_PORT_Msk & (_UINT32_(value) << PAC_INTFLAGA_PORT_Pos)) /* Assigment of value for PORT in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_DMA_Pos                  _UINT32_(19)                                         /* (PAC_INTFLAGA) DMA Position */
#define PAC_INTFLAGA_DMA_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_DMA_Pos)              /* (PAC_INTFLAGA) DMA Mask */
#define PAC_INTFLAGA_DMA(value)               (PAC_INTFLAGA_DMA_Msk & (_UINT32_(value) << PAC_INTFLAGA_DMA_Pos)) /* Assigment of value for DMA in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_PRM_Pos                  _UINT32_(21)                                         /* (PAC_INTFLAGA) PRM Position */
#define PAC_INTFLAGA_PRM_Msk                  (_UINT32_(0x1) << PAC_INTFLAGA_PRM_Pos)              /* (PAC_INTFLAGA) PRM Mask */
#define PAC_INTFLAGA_PRM(value)               (PAC_INTFLAGA_PRM_Msk & (_UINT32_(value) << PAC_INTFLAGA_PRM_Pos)) /* Assigment of value for PRM in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_EVSYS_Pos                _UINT32_(22)                                         /* (PAC_INTFLAGA) EVSYS Position */
#define PAC_INTFLAGA_EVSYS_Msk                (_UINT32_(0x1) << PAC_INTFLAGA_EVSYS_Pos)            /* (PAC_INTFLAGA) EVSYS Mask */
#define PAC_INTFLAGA_EVSYS(value)             (PAC_INTFLAGA_EVSYS_Msk & (_UINT32_(value) << PAC_INTFLAGA_EVSYS_Pos)) /* Assigment of value for EVSYS in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM0_Pos              _UINT32_(23)                                         /* (PAC_INTFLAGA) SERCOM0 Position */
#define PAC_INTFLAGA_SERCOM0_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM0_Pos)          /* (PAC_INTFLAGA) SERCOM0 Mask */
#define PAC_INTFLAGA_SERCOM0(value)           (PAC_INTFLAGA_SERCOM0_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM0_Pos)) /* Assigment of value for SERCOM0 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM1_Pos              _UINT32_(24)                                         /* (PAC_INTFLAGA) SERCOM1 Position */
#define PAC_INTFLAGA_SERCOM1_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM1_Pos)          /* (PAC_INTFLAGA) SERCOM1 Mask */
#define PAC_INTFLAGA_SERCOM1(value)           (PAC_INTFLAGA_SERCOM1_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM1_Pos)) /* Assigment of value for SERCOM1 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM2_Pos              _UINT32_(25)                                         /* (PAC_INTFLAGA) SERCOM2 Position */
#define PAC_INTFLAGA_SERCOM2_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM2_Pos)          /* (PAC_INTFLAGA) SERCOM2 Mask */
#define PAC_INTFLAGA_SERCOM2(value)           (PAC_INTFLAGA_SERCOM2_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM3_Pos              _UINT32_(26)                                         /* (PAC_INTFLAGA) SERCOM3 Position */
#define PAC_INTFLAGA_SERCOM3_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM3_Pos)          /* (PAC_INTFLAGA) SERCOM3 Mask */
#define PAC_INTFLAGA_SERCOM3(value)           (PAC_INTFLAGA_SERCOM3_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM3_Pos)) /* Assigment of value for SERCOM3 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM4_Pos              _UINT32_(27)                                         /* (PAC_INTFLAGA) SERCOM4 Position */
#define PAC_INTFLAGA_SERCOM4_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM4_Pos)          /* (PAC_INTFLAGA) SERCOM4 Mask */
#define PAC_INTFLAGA_SERCOM4(value)           (PAC_INTFLAGA_SERCOM4_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM5_Pos              _UINT32_(28)                                         /* (PAC_INTFLAGA) SERCOM5 Position */
#define PAC_INTFLAGA_SERCOM5_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM5_Pos)          /* (PAC_INTFLAGA) SERCOM5 Mask */
#define PAC_INTFLAGA_SERCOM5(value)           (PAC_INTFLAGA_SERCOM5_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM6_Pos              _UINT32_(29)                                         /* (PAC_INTFLAGA) SERCOM6 Position */
#define PAC_INTFLAGA_SERCOM6_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM6_Pos)          /* (PAC_INTFLAGA) SERCOM6 Mask */
#define PAC_INTFLAGA_SERCOM6(value)           (PAC_INTFLAGA_SERCOM6_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM6_Pos)) /* Assigment of value for SERCOM6 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM7_Pos              _UINT32_(30)                                         /* (PAC_INTFLAGA) SERCOM7 Position */
#define PAC_INTFLAGA_SERCOM7_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM7_Pos)          /* (PAC_INTFLAGA) SERCOM7 Mask */
#define PAC_INTFLAGA_SERCOM7(value)           (PAC_INTFLAGA_SERCOM7_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM7_Pos)) /* Assigment of value for SERCOM7 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_SERCOM8_Pos              _UINT32_(31)                                         /* (PAC_INTFLAGA) SERCOM8 Position */
#define PAC_INTFLAGA_SERCOM8_Msk              (_UINT32_(0x1) << PAC_INTFLAGA_SERCOM8_Pos)          /* (PAC_INTFLAGA) SERCOM8 Mask */
#define PAC_INTFLAGA_SERCOM8(value)           (PAC_INTFLAGA_SERCOM8_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM8_Pos)) /* Assigment of value for SERCOM8 in the PAC_INTFLAGA register */
#define PAC_INTFLAGA_Msk                      _UINT32_(0xFFEFFFFF)                                 /* (PAC_INTFLAGA) Register Mask  */

#define PAC_INTFLAGA_SERCOM_Pos               _UINT32_(23)                                         /* (PAC_INTFLAGA Position) SERCOM8 */
#define PAC_INTFLAGA_SERCOM_Msk               (_UINT32_(0x1FF) << PAC_INTFLAGA_SERCOM_Pos)         /* (PAC_INTFLAGA Mask) SERCOM */
#define PAC_INTFLAGA_SERCOM(value)            (PAC_INTFLAGA_SERCOM_Msk & (_UINT32_(value) << PAC_INTFLAGA_SERCOM_Pos)) 

/* -------- PAC_INTFLAGB : (PAC Offset: 0x18) (R/W 32) Peripheral interrupt flag status - Bridge B -------- */
#define PAC_INTFLAGB_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_INTFLAGB) Peripheral interrupt flag status - Bridge B  Reset Value */

