Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/pac.h
/* -------- PAC_INTFLAGC : (PAC Offset: 0x1C) (R/W 32) Peripheral interrupt flag status - Bridge C -------- */
#define PAC_INTFLAGC_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_INTFLAGC) Peripheral interrupt flag status - Bridge C  Reset Value */

#define PAC_INTFLAGC_MLB_Pos                  _UINT32_(2)                                          /* (PAC_INTFLAGC) MLB Position */
#define PAC_INTFLAGC_MLB_Msk                  (_UINT32_(0x1) << PAC_INTFLAGC_MLB_Pos)              /* (PAC_INTFLAGC) MLB Mask */
#define PAC_INTFLAGC_MLB(value)               (PAC_INTFLAGC_MLB_Msk & (_UINT32_(value) << PAC_INTFLAGC_MLB_Pos)) /* Assigment of value for MLB in the PAC_INTFLAGC register */
#define PAC_INTFLAGC_Msk                      _UINT32_(0x00000004)                                 /* (PAC_INTFLAGC) Register Mask  */


/* -------- PAC_STATUSA : (PAC Offset: 0x34) ( R/ 32) Peripheral write protection status - Bridge A -------- */
#define PAC_STATUSA_RESETVALUE                _UINT32_(0x00)                                       /*  (PAC_STATUSA) Peripheral write protection status - Bridge A  Reset Value */

#define PAC_STATUSA_DSU_Pos                   _UINT32_(0)                                          /* (PAC_STATUSA) DSU APB Protect Enable Position */
#define PAC_STATUSA_DSU_Msk                   (_UINT32_(0x1) << PAC_STATUSA_DSU_Pos)               /* (PAC_STATUSA) DSU APB Protect Enable Mask */
#define PAC_STATUSA_DSU(value)                (PAC_STATUSA_DSU_Msk & (_UINT32_(value) << PAC_STATUSA_DSU_Pos)) /* Assigment of value for DSU in the PAC_STATUSA register */
#define PAC_STATUSA_FCW_Pos                   _UINT32_(1)                                          /* (PAC_STATUSA) FCW APB Protect Enable Position */
#define PAC_STATUSA_FCW_Msk                   (_UINT32_(0x1) << PAC_STATUSA_FCW_Pos)               /* (PAC_STATUSA) FCW APB Protect Enable Mask */
#define PAC_STATUSA_FCW(value)                (PAC_STATUSA_FCW_Msk & (_UINT32_(value) << PAC_STATUSA_FCW_Pos)) /* Assigment of value for FCW in the PAC_STATUSA register */
#define PAC_STATUSA_FCR_Pos                   _UINT32_(2)                                          /* (PAC_STATUSA) FCR APB Protect Enable Position */
#define PAC_STATUSA_FCR_Msk                   (_UINT32_(0x1) << PAC_STATUSA_FCR_Pos)               /* (PAC_STATUSA) FCR APB Protect Enable Mask */
#define PAC_STATUSA_FCR(value)                (PAC_STATUSA_FCR_Msk & (_UINT32_(value) << PAC_STATUSA_FCR_Pos)) /* Assigment of value for FCR in the PAC_STATUSA register */
#define PAC_STATUSA_PM_Pos                    _UINT32_(3)                                          /* (PAC_STATUSA) PM APB Protect Enable Position */
#define PAC_STATUSA_PM_Msk                    (_UINT32_(0x1) << PAC_STATUSA_PM_Pos)                /* (PAC_STATUSA) PM APB Protect Enable Mask */
#define PAC_STATUSA_PM(value)                 (PAC_STATUSA_PM_Msk & (_UINT32_(value) << PAC_STATUSA_PM_Pos)) /* Assigment of value for PM in the PAC_STATUSA register */
#define PAC_STATUSA_SUPC_Pos                  _UINT32_(4)                                          /* (PAC_STATUSA) SUPC APB Protect Enable Position */
#define PAC_STATUSA_SUPC_Msk                  (_UINT32_(0x1) << PAC_STATUSA_SUPC_Pos)              /* (PAC_STATUSA) SUPC APB Protect Enable Mask */
#define PAC_STATUSA_SUPC(value)               (PAC_STATUSA_SUPC_Msk & (_UINT32_(value) << PAC_STATUSA_SUPC_Pos)) /* Assigment of value for SUPC in the PAC_STATUSA register */
#define PAC_STATUSA_RSTC_Pos                  _UINT32_(5)                                          /* (PAC_STATUSA) RSTC APB Protect Enable Position */
#define PAC_STATUSA_RSTC_Msk                  (_UINT32_(0x1) << PAC_STATUSA_RSTC_Pos)              /* (PAC_STATUSA) RSTC APB Protect Enable Mask */
#define PAC_STATUSA_RSTC(value)               (PAC_STATUSA_RSTC_Msk & (_UINT32_(value) << PAC_STATUSA_RSTC_Pos)) /* Assigment of value for RSTC in the PAC_STATUSA register */
#define PAC_STATUSA_OSCCTRL_Pos               _UINT32_(6)                                          /* (PAC_STATUSA) OSCCTRL APB Protect Enable Position */
#define PAC_STATUSA_OSCCTRL_Msk               (_UINT32_(0x1) << PAC_STATUSA_OSCCTRL_Pos)           /* (PAC_STATUSA) OSCCTRL APB Protect Enable Mask */
#define PAC_STATUSA_OSCCTRL(value)            (PAC_STATUSA_OSCCTRL_Msk & (_UINT32_(value) << PAC_STATUSA_OSCCTRL_Pos)) /* Assigment of value for OSCCTRL in the PAC_STATUSA register */
#define PAC_STATUSA_OSC32KCTRL_Pos            _UINT32_(7)                                          /* (PAC_STATUSA) OSC32KCTRL APB Protect Enable Position */
#define PAC_STATUSA_OSC32KCTRL_Msk            (_UINT32_(0x1) << PAC_STATUSA_OSC32KCTRL_Pos)        /* (PAC_STATUSA) OSC32KCTRL APB Protect Enable Mask */
#define PAC_STATUSA_OSC32KCTRL(value)         (PAC_STATUSA_OSC32KCTRL_Msk & (_UINT32_(value) << PAC_STATUSA_OSC32KCTRL_Pos)) /* Assigment of value for OSC32KCTRL in the PAC_STATUSA register */
#define PAC_STATUSA_GCLK_Pos                  _UINT32_(8)                                          /* (PAC_STATUSA) GCLK APB Protect Enable Position */
#define PAC_STATUSA_GCLK_Msk                  (_UINT32_(0x1) << PAC_STATUSA_GCLK_Pos)              /* (PAC_STATUSA) GCLK APB Protect Enable Mask */
#define PAC_STATUSA_GCLK(value)               (PAC_STATUSA_GCLK_Msk & (_UINT32_(value) << PAC_STATUSA_GCLK_Pos)) /* Assigment of value for GCLK in the PAC_STATUSA register */
#define PAC_STATUSA_MCLK_Pos                  _UINT32_(9)                                          /* (PAC_STATUSA) MCLK APB Protect Enable Position */
#define PAC_STATUSA_MCLK_Msk                  (_UINT32_(0x1) << PAC_STATUSA_MCLK_Pos)              /* (PAC_STATUSA) MCLK APB Protect Enable Mask */
#define PAC_STATUSA_MCLK(value)               (PAC_STATUSA_MCLK_Msk & (_UINT32_(value) << PAC_STATUSA_MCLK_Pos)) /* Assigment of value for MCLK in the PAC_STATUSA register */
#define PAC_STATUSA_FREQM_Pos                 _UINT32_(10)                                         /* (PAC_STATUSA) FREQM APB Protect Enable Position */
#define PAC_STATUSA_FREQM_Msk                 (_UINT32_(0x1) << PAC_STATUSA_FREQM_Pos)             /* (PAC_STATUSA) FREQM APB Protect Enable Mask */
#define PAC_STATUSA_FREQM(value)              (PAC_STATUSA_FREQM_Msk & (_UINT32_(value) << PAC_STATUSA_FREQM_Pos)) /* Assigment of value for FREQM in the PAC_STATUSA register */
#define PAC_STATUSA_WDT_Pos                   _UINT32_(11)                                         /* (PAC_STATUSA) WDT APB Protect Enable Position */
#define PAC_STATUSA_WDT_Msk                   (_UINT32_(0x1) << PAC_STATUSA_WDT_Pos)               /* (PAC_STATUSA) WDT APB Protect Enable Mask */
#define PAC_STATUSA_WDT(value)                (PAC_STATUSA_WDT_Msk & (_UINT32_(value) << PAC_STATUSA_WDT_Pos)) /* Assigment of value for WDT in the PAC_STATUSA register */
#define PAC_STATUSA_RTC_Pos                   _UINT32_(12)                                         /* (PAC_STATUSA) RTC APB Protect Enable Position */
#define PAC_STATUSA_RTC_Msk                   (_UINT32_(0x1) << PAC_STATUSA_RTC_Pos)               /* (PAC_STATUSA) RTC APB Protect Enable Mask */
#define PAC_STATUSA_RTC(value)                (PAC_STATUSA_RTC_Msk & (_UINT32_(value) << PAC_STATUSA_RTC_Pos)) /* Assigment of value for RTC in the PAC_STATUSA register */
#define PAC_STATUSA_EIC_Pos                   _UINT32_(13)                                         /* (PAC_STATUSA) EIC APB Protect Enable Position */
#define PAC_STATUSA_EIC_Msk                   (_UINT32_(0x1) << PAC_STATUSA_EIC_Pos)               /* (PAC_STATUSA) EIC APB Protect Enable Mask */
#define PAC_STATUSA_EIC(value)                (PAC_STATUSA_EIC_Msk & (_UINT32_(value) << PAC_STATUSA_EIC_Pos)) /* Assigment of value for EIC in the PAC_STATUSA register */
#define PAC_STATUSA_PAC_Pos                   _UINT32_(14)                                         /* (PAC_STATUSA) PAC APB Protect Enable Position */
#define PAC_STATUSA_PAC_Msk                   (_UINT32_(0x1) << PAC_STATUSA_PAC_Pos)               /* (PAC_STATUSA) PAC APB Protect Enable Mask */
#define PAC_STATUSA_PAC(value)                (PAC_STATUSA_PAC_Msk & (_UINT32_(value) << PAC_STATUSA_PAC_Pos)) /* Assigment of value for PAC in the PAC_STATUSA register */
#define PAC_STATUSA_DRMTCM_Pos                _UINT32_(15)                                         /* (PAC_STATUSA) DRMTCM APB Protect Enable Position */
#define PAC_STATUSA_DRMTCM_Msk                (_UINT32_(0x1) << PAC_STATUSA_DRMTCM_Pos)            /* (PAC_STATUSA) DRMTCM APB Protect Enable Mask */
#define PAC_STATUSA_DRMTCM(value)             (PAC_STATUSA_DRMTCM_Msk & (_UINT32_(value) << PAC_STATUSA_DRMTCM_Pos)) /* Assigment of value for DRMTCM in the PAC_STATUSA register */
#define PAC_STATUSA_MCRAMC_Pos                _UINT32_(16)                                         /* (PAC_STATUSA) MCRAMC APB Protect Enable Position */
#define PAC_STATUSA_MCRAMC_Msk                (_UINT32_(0x1) << PAC_STATUSA_MCRAMC_Pos)            /* (PAC_STATUSA) MCRAMC APB Protect Enable Mask */
#define PAC_STATUSA_MCRAMC(value)             (PAC_STATUSA_MCRAMC_Msk & (_UINT32_(value) << PAC_STATUSA_MCRAMC_Pos)) /* Assigment of value for MCRAMC in the PAC_STATUSA register */
#define PAC_STATUSA_TRAM_Pos                  _UINT32_(17)                                         /* (PAC_STATUSA) TRAM APB Protect Enable Position */
#define PAC_STATUSA_TRAM_Msk                  (_UINT32_(0x1) << PAC_STATUSA_TRAM_Pos)              /* (PAC_STATUSA) TRAM APB Protect Enable Mask */
#define PAC_STATUSA_TRAM(value)               (PAC_STATUSA_TRAM_Msk & (_UINT32_(value) << PAC_STATUSA_TRAM_Pos)) /* Assigment of value for TRAM in the PAC_STATUSA register */
#define PAC_STATUSA_PORT_Pos                  _UINT32_(18)                                         /* (PAC_STATUSA) PORT APB Protect Enable Position */
#define PAC_STATUSA_PORT_Msk                  (_UINT32_(0x1) << PAC_STATUSA_PORT_Pos)              /* (PAC_STATUSA) PORT APB Protect Enable Mask */
#define PAC_STATUSA_PORT(value)               (PAC_STATUSA_PORT_Msk & (_UINT32_(value) << PAC_STATUSA_PORT_Pos)) /* Assigment of value for PORT in the PAC_STATUSA register */
#define PAC_STATUSA_DMA_Pos                   _UINT32_(19)                                         /* (PAC_STATUSA) DMA APB Protect Enable Position */
#define PAC_STATUSA_DMA_Msk                   (_UINT32_(0x1) << PAC_STATUSA_DMA_Pos)               /* (PAC_STATUSA) DMA APB Protect Enable Mask */
#define PAC_STATUSA_DMA(value)                (PAC_STATUSA_DMA_Msk & (_UINT32_(value) << PAC_STATUSA_DMA_Pos)) /* Assigment of value for DMA in the PAC_STATUSA register */
#define PAC_STATUSA_PRM_Pos                   _UINT32_(21)                                         /* (PAC_STATUSA) PRM APB Protect Enable Position */
#define PAC_STATUSA_PRM_Msk                   (_UINT32_(0x1) << PAC_STATUSA_PRM_Pos)               /* (PAC_STATUSA) PRM APB Protect Enable Mask */
#define PAC_STATUSA_PRM(value)                (PAC_STATUSA_PRM_Msk & (_UINT32_(value) << PAC_STATUSA_PRM_Pos)) /* Assigment of value for PRM in the PAC_STATUSA register */
#define PAC_STATUSA_EVSYS_Pos                 _UINT32_(22)                                         /* (PAC_STATUSA) EVSYS APB Protect Enable Position */
#define PAC_STATUSA_EVSYS_Msk                 (_UINT32_(0x1) << PAC_STATUSA_EVSYS_Pos)             /* (PAC_STATUSA) EVSYS APB Protect Enable Mask */
#define PAC_STATUSA_EVSYS(value)              (PAC_STATUSA_EVSYS_Msk & (_UINT32_(value) << PAC_STATUSA_EVSYS_Pos)) /* Assigment of value for EVSYS in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM0_Pos               _UINT32_(23)                                         /* (PAC_STATUSA) SERCOM0 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM0_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM0_Pos)           /* (PAC_STATUSA) SERCOM0 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM0(value)            (PAC_STATUSA_SERCOM0_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM0_Pos)) /* Assigment of value for SERCOM0 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM1_Pos               _UINT32_(24)                                         /* (PAC_STATUSA) SERCOM1 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM1_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM1_Pos)           /* (PAC_STATUSA) SERCOM1 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM1(value)            (PAC_STATUSA_SERCOM1_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM1_Pos)) /* Assigment of value for SERCOM1 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM2_Pos               _UINT32_(25)                                         /* (PAC_STATUSA) SERCOM2 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM2_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM2_Pos)           /* (PAC_STATUSA) SERCOM2 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM2(value)            (PAC_STATUSA_SERCOM2_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM3_Pos               _UINT32_(26)                                         /* (PAC_STATUSA) SERCOM3 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM3_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM3_Pos)           /* (PAC_STATUSA) SERCOM3 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM3(value)            (PAC_STATUSA_SERCOM3_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM3_Pos)) /* Assigment of value for SERCOM3 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM4_Pos               _UINT32_(27)                                         /* (PAC_STATUSA) SERCOM4 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM4_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM4_Pos)           /* (PAC_STATUSA) SERCOM4 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM4(value)            (PAC_STATUSA_SERCOM4_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM5_Pos               _UINT32_(28)                                         /* (PAC_STATUSA) SERCOM5 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM5_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM5_Pos)           /* (PAC_STATUSA) SERCOM5 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM5(value)            (PAC_STATUSA_SERCOM5_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM6_Pos               _UINT32_(29)                                         /* (PAC_STATUSA) SERCOM6 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM6_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM6_Pos)           /* (PAC_STATUSA) SERCOM6 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM6(value)            (PAC_STATUSA_SERCOM6_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM6_Pos)) /* Assigment of value for SERCOM6 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM7_Pos               _UINT32_(30)                                         /* (PAC_STATUSA) SERCOM7 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM7_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM7_Pos)           /* (PAC_STATUSA) SERCOM7 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM7(value)            (PAC_STATUSA_SERCOM7_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM7_Pos)) /* Assigment of value for SERCOM7 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM8_Pos               _UINT32_(31)                                         /* (PAC_STATUSA) SERCOM8 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM8_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM8_Pos)           /* (PAC_STATUSA) SERCOM8 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM8(value)            (PAC_STATUSA_SERCOM8_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM8_Pos)) /* Assigment of value for SERCOM8 in the PAC_STATUSA register */
#define PAC_STATUSA_Msk                       _UINT32_(0xFFEFFFFF)                                 /* (PAC_STATUSA) Register Mask  */

#define PAC_STATUSA_SERCOM_Pos                _UINT32_(23)                                         /* (PAC_STATUSA Position) SERCOM8 APB Protect Enable */
#define PAC_STATUSA_SERCOM_Msk                (_UINT32_(0x1FF) << PAC_STATUSA_SERCOM_Pos)          /* (PAC_STATUSA Mask) SERCOM */
#define PAC_STATUSA_SERCOM(value)             (PAC_STATUSA_SERCOM_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM_Pos)) 

/* -------- PAC_STATUSB : (PAC Offset: 0x38) ( R/ 32) Peripheral write protection status - Bridge B -------- */
#define PAC_STATUSB_RESETVALUE                _UINT32_(0x00)                                       /*  (PAC_STATUSB) Peripheral write protection status - Bridge B  Reset Value */

