Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/pac.h
#define PAC_STATUSB_SERCOM9_Pos               _UINT32_(0)                                          /* (PAC_STATUSB) SERCOM9 APB Protect Enable Position */
#define PAC_STATUSB_SERCOM9_Msk               (_UINT32_(0x1) << PAC_STATUSB_SERCOM9_Pos)           /* (PAC_STATUSB) SERCOM9 APB Protect Enable Mask */
#define PAC_STATUSB_SERCOM9(value)            (PAC_STATUSB_SERCOM9_Msk & (_UINT32_(value) << PAC_STATUSB_SERCOM9_Pos)) /* Assigment of value for SERCOM9 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC0_Pos                  _UINT32_(1)                                          /* (PAC_STATUSB) TCC0 APB Protect Enable Position */
#define PAC_STATUSB_TCC0_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC0_Pos)              /* (PAC_STATUSB) TCC0 APB Protect Enable Mask */
#define PAC_STATUSB_TCC0(value)               (PAC_STATUSB_TCC0_Msk & (_UINT32_(value) << PAC_STATUSB_TCC0_Pos)) /* Assigment of value for TCC0 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC1_Pos                  _UINT32_(2)                                          /* (PAC_STATUSB) TCC1 APB Protect Enable Position */
#define PAC_STATUSB_TCC1_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC1_Pos)              /* (PAC_STATUSB) TCC1 APB Protect Enable Mask */
#define PAC_STATUSB_TCC1(value)               (PAC_STATUSB_TCC1_Msk & (_UINT32_(value) << PAC_STATUSB_TCC1_Pos)) /* Assigment of value for TCC1 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC2_Pos                  _UINT32_(3)                                          /* (PAC_STATUSB) TCC2 APB Protect Enable Position */
#define PAC_STATUSB_TCC2_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC2_Pos)              /* (PAC_STATUSB) TCC2 APB Protect Enable Mask */
#define PAC_STATUSB_TCC2(value)               (PAC_STATUSB_TCC2_Msk & (_UINT32_(value) << PAC_STATUSB_TCC2_Pos)) /* Assigment of value for TCC2 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC3_Pos                  _UINT32_(4)                                          /* (PAC_STATUSB) TCC3 APB Protect Enable Position */
#define PAC_STATUSB_TCC3_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC3_Pos)              /* (PAC_STATUSB) TCC3 APB Protect Enable Mask */
#define PAC_STATUSB_TCC3(value)               (PAC_STATUSB_TCC3_Msk & (_UINT32_(value) << PAC_STATUSB_TCC3_Pos)) /* Assigment of value for TCC3 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC4_Pos                  _UINT32_(5)                                          /* (PAC_STATUSB) TCC4 APB Protect Enable Position */
#define PAC_STATUSB_TCC4_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC4_Pos)              /* (PAC_STATUSB) TCC4 APB Protect Enable Mask */
#define PAC_STATUSB_TCC4(value)               (PAC_STATUSB_TCC4_Msk & (_UINT32_(value) << PAC_STATUSB_TCC4_Pos)) /* Assigment of value for TCC4 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC5_Pos                  _UINT32_(6)                                          /* (PAC_STATUSB) TCC5 APB Protect Enable Position */
#define PAC_STATUSB_TCC5_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC5_Pos)              /* (PAC_STATUSB) TCC5 APB Protect Enable Mask */
#define PAC_STATUSB_TCC5(value)               (PAC_STATUSB_TCC5_Msk & (_UINT32_(value) << PAC_STATUSB_TCC5_Pos)) /* Assigment of value for TCC5 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC6_Pos                  _UINT32_(7)                                          /* (PAC_STATUSB) TCC6 APB Protect Enable Position */
#define PAC_STATUSB_TCC6_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC6_Pos)              /* (PAC_STATUSB) TCC6 APB Protect Enable Mask */
#define PAC_STATUSB_TCC6(value)               (PAC_STATUSB_TCC6_Msk & (_UINT32_(value) << PAC_STATUSB_TCC6_Pos)) /* Assigment of value for TCC6 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC7_Pos                  _UINT32_(8)                                          /* (PAC_STATUSB) TCC7 APB Protect Enable Position */
#define PAC_STATUSB_TCC7_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC7_Pos)              /* (PAC_STATUSB) TCC7 APB Protect Enable Mask */
#define PAC_STATUSB_TCC7(value)               (PAC_STATUSB_TCC7_Msk & (_UINT32_(value) << PAC_STATUSB_TCC7_Pos)) /* Assigment of value for TCC7 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC8_Pos                  _UINT32_(9)                                          /* (PAC_STATUSB) TCC8 APB Protect Enable Position */
#define PAC_STATUSB_TCC8_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC8_Pos)              /* (PAC_STATUSB) TCC8 APB Protect Enable Mask */
#define PAC_STATUSB_TCC8(value)               (PAC_STATUSB_TCC8_Msk & (_UINT32_(value) << PAC_STATUSB_TCC8_Pos)) /* Assigment of value for TCC8 in the PAC_STATUSB register */
#define PAC_STATUSB_TCC9_Pos                  _UINT32_(10)                                         /* (PAC_STATUSB) TCC9 APB Protect Enable Position */
#define PAC_STATUSB_TCC9_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TCC9_Pos)              /* (PAC_STATUSB) TCC9 APB Protect Enable Mask */
#define PAC_STATUSB_TCC9(value)               (PAC_STATUSB_TCC9_Msk & (_UINT32_(value) << PAC_STATUSB_TCC9_Pos)) /* Assigment of value for TCC9 in the PAC_STATUSB register */
#define PAC_STATUSB_ADC_Pos                   _UINT32_(11)                                         /* (PAC_STATUSB) ADC APB Protect Enable Position */
#define PAC_STATUSB_ADC_Msk                   (_UINT32_(0x1) << PAC_STATUSB_ADC_Pos)               /* (PAC_STATUSB) ADC APB Protect Enable Mask */
#define PAC_STATUSB_ADC(value)                (PAC_STATUSB_ADC_Msk & (_UINT32_(value) << PAC_STATUSB_ADC_Pos)) /* Assigment of value for ADC in the PAC_STATUSB register */
#define PAC_STATUSB_AC_Pos                    _UINT32_(12)                                         /* (PAC_STATUSB) AC APB Protect Enable Position */
#define PAC_STATUSB_AC_Msk                    (_UINT32_(0x1) << PAC_STATUSB_AC_Pos)                /* (PAC_STATUSB) AC APB Protect Enable Mask */
#define PAC_STATUSB_AC(value)                 (PAC_STATUSB_AC_Msk & (_UINT32_(value) << PAC_STATUSB_AC_Pos)) /* Assigment of value for AC in the PAC_STATUSB register */
#define PAC_STATUSB_PTC_Pos                   _UINT32_(13)                                         /* (PAC_STATUSB) PTC APB Protect Enable Position */
#define PAC_STATUSB_PTC_Msk                   (_UINT32_(0x1) << PAC_STATUSB_PTC_Pos)               /* (PAC_STATUSB) PTC APB Protect Enable Mask */
#define PAC_STATUSB_PTC(value)                (PAC_STATUSB_PTC_Msk & (_UINT32_(value) << PAC_STATUSB_PTC_Pos)) /* Assigment of value for PTC in the PAC_STATUSB register */
#define PAC_STATUSB_SPI_IXS0_Pos              _UINT32_(14)                                         /* (PAC_STATUSB) SPI_IXS0 APB Protect Enable Position */
#define PAC_STATUSB_SPI_IXS0_Msk              (_UINT32_(0x1) << PAC_STATUSB_SPI_IXS0_Pos)          /* (PAC_STATUSB) SPI_IXS0 APB Protect Enable Mask */
#define PAC_STATUSB_SPI_IXS0(value)           (PAC_STATUSB_SPI_IXS0_Msk & (_UINT32_(value) << PAC_STATUSB_SPI_IXS0_Pos)) /* Assigment of value for SPI_IXS0 in the PAC_STATUSB register */
#define PAC_STATUSB_SPI_IXS1_Pos              _UINT32_(15)                                         /* (PAC_STATUSB) SPI_IXS1 APB Protect Enable Position */
#define PAC_STATUSB_SPI_IXS1_Msk              (_UINT32_(0x1) << PAC_STATUSB_SPI_IXS1_Pos)          /* (PAC_STATUSB) SPI_IXS1 APB Protect Enable Mask */
#define PAC_STATUSB_SPI_IXS1(value)           (PAC_STATUSB_SPI_IXS1_Msk & (_UINT32_(value) << PAC_STATUSB_SPI_IXS1_Pos)) /* Assigment of value for SPI_IXS1 in the PAC_STATUSB register */
#define PAC_STATUSB_CAN0_Pos                  _UINT32_(16)                                         /* (PAC_STATUSB) CAN0 APB Protect Enable Position */
#define PAC_STATUSB_CAN0_Msk                  (_UINT32_(0x1) << PAC_STATUSB_CAN0_Pos)              /* (PAC_STATUSB) CAN0 APB Protect Enable Mask */
#define PAC_STATUSB_CAN0(value)               (PAC_STATUSB_CAN0_Msk & (_UINT32_(value) << PAC_STATUSB_CAN0_Pos)) /* Assigment of value for CAN0 in the PAC_STATUSB register */
#define PAC_STATUSB_CAN1_Pos                  _UINT32_(17)                                         /* (PAC_STATUSB) CAN1 APB Protect Enable Position */
#define PAC_STATUSB_CAN1_Msk                  (_UINT32_(0x1) << PAC_STATUSB_CAN1_Pos)              /* (PAC_STATUSB) CAN1 APB Protect Enable Mask */
#define PAC_STATUSB_CAN1(value)               (PAC_STATUSB_CAN1_Msk & (_UINT32_(value) << PAC_STATUSB_CAN1_Pos)) /* Assigment of value for CAN1 in the PAC_STATUSB register */
#define PAC_STATUSB_CAN2_Pos                  _UINT32_(18)                                         /* (PAC_STATUSB) CAN2 APB Protect Enable Position */
#define PAC_STATUSB_CAN2_Msk                  (_UINT32_(0x1) << PAC_STATUSB_CAN2_Pos)              /* (PAC_STATUSB) CAN2 APB Protect Enable Mask */
#define PAC_STATUSB_CAN2(value)               (PAC_STATUSB_CAN2_Msk & (_UINT32_(value) << PAC_STATUSB_CAN2_Pos)) /* Assigment of value for CAN2 in the PAC_STATUSB register */
#define PAC_STATUSB_CAN3_Pos                  _UINT32_(19)                                         /* (PAC_STATUSB) CAN3 APB Protect Enable Position */
#define PAC_STATUSB_CAN3_Msk                  (_UINT32_(0x1) << PAC_STATUSB_CAN3_Pos)              /* (PAC_STATUSB) CAN3 APB Protect Enable Mask */
#define PAC_STATUSB_CAN3(value)               (PAC_STATUSB_CAN3_Msk & (_UINT32_(value) << PAC_STATUSB_CAN3_Pos)) /* Assigment of value for CAN3 in the PAC_STATUSB register */
#define PAC_STATUSB_CAN4_Pos                  _UINT32_(20)                                         /* (PAC_STATUSB) CAN4 APB Protect Enable Position */
#define PAC_STATUSB_CAN4_Msk                  (_UINT32_(0x1) << PAC_STATUSB_CAN4_Pos)              /* (PAC_STATUSB) CAN4 APB Protect Enable Mask */
#define PAC_STATUSB_CAN4(value)               (PAC_STATUSB_CAN4_Msk & (_UINT32_(value) << PAC_STATUSB_CAN4_Pos)) /* Assigment of value for CAN4 in the PAC_STATUSB register */
#define PAC_STATUSB_CAN5_Pos                  _UINT32_(21)                                         /* (PAC_STATUSB) CAN5 APB Protect Enable Position */
#define PAC_STATUSB_CAN5_Msk                  (_UINT32_(0x1) << PAC_STATUSB_CAN5_Pos)              /* (PAC_STATUSB) CAN5 APB Protect Enable Mask */
#define PAC_STATUSB_CAN5(value)               (PAC_STATUSB_CAN5_Msk & (_UINT32_(value) << PAC_STATUSB_CAN5_Pos)) /* Assigment of value for CAN5 in the PAC_STATUSB register */
#define PAC_STATUSB_ETH_Pos                   _UINT32_(24)                                         /* (PAC_STATUSB) ETH APB Protect Enable Position */
#define PAC_STATUSB_ETH_Msk                   (_UINT32_(0x1) << PAC_STATUSB_ETH_Pos)               /* (PAC_STATUSB) ETH APB Protect Enable Mask */
#define PAC_STATUSB_ETH(value)                (PAC_STATUSB_ETH_Msk & (_UINT32_(value) << PAC_STATUSB_ETH_Pos)) /* Assigment of value for ETH in the PAC_STATUSB register */
#define PAC_STATUSB_SQI0_Pos                  _UINT32_(25)                                         /* (PAC_STATUSB) SQI0 APB Protect Enable Position */
#define PAC_STATUSB_SQI0_Msk                  (_UINT32_(0x1) << PAC_STATUSB_SQI0_Pos)              /* (PAC_STATUSB) SQI0 APB Protect Enable Mask */
#define PAC_STATUSB_SQI0(value)               (PAC_STATUSB_SQI0_Msk & (_UINT32_(value) << PAC_STATUSB_SQI0_Pos)) /* Assigment of value for SQI0 in the PAC_STATUSB register */
#define PAC_STATUSB_SQI1_Pos                  _UINT32_(26)                                         /* (PAC_STATUSB) SQI1 APB Protect Enable Position */
#define PAC_STATUSB_SQI1_Msk                  (_UINT32_(0x1) << PAC_STATUSB_SQI1_Pos)              /* (PAC_STATUSB) SQI1 APB Protect Enable Mask */
#define PAC_STATUSB_SQI1(value)               (PAC_STATUSB_SQI1_Msk & (_UINT32_(value) << PAC_STATUSB_SQI1_Pos)) /* Assigment of value for SQI1 in the PAC_STATUSB register */
#define PAC_STATUSB_TRNG_Pos                  _UINT32_(27)                                         /* (PAC_STATUSB) TRNG APB Protect Enable Position */
#define PAC_STATUSB_TRNG_Msk                  (_UINT32_(0x1) << PAC_STATUSB_TRNG_Pos)              /* (PAC_STATUSB) TRNG APB Protect Enable Mask */
#define PAC_STATUSB_TRNG(value)               (PAC_STATUSB_TRNG_Msk & (_UINT32_(value) << PAC_STATUSB_TRNG_Pos)) /* Assigment of value for TRNG in the PAC_STATUSB register */
#define PAC_STATUSB_SDMMC0_Pos                _UINT32_(28)                                         /* (PAC_STATUSB) SDMMC0 APB Protect Enable Position */
#define PAC_STATUSB_SDMMC0_Msk                (_UINT32_(0x1) << PAC_STATUSB_SDMMC0_Pos)            /* (PAC_STATUSB) SDMMC0 APB Protect Enable Mask */
#define PAC_STATUSB_SDMMC0(value)             (PAC_STATUSB_SDMMC0_Msk & (_UINT32_(value) << PAC_STATUSB_SDMMC0_Pos)) /* Assigment of value for SDMMC0 in the PAC_STATUSB register */
#define PAC_STATUSB_SDMMC1_Pos                _UINT32_(29)                                         /* (PAC_STATUSB) SDMMC1 APB Protect Enable Position */
#define PAC_STATUSB_SDMMC1_Msk                (_UINT32_(0x1) << PAC_STATUSB_SDMMC1_Pos)            /* (PAC_STATUSB) SDMMC1 APB Protect Enable Mask */
#define PAC_STATUSB_SDMMC1(value)             (PAC_STATUSB_SDMMC1_Msk & (_UINT32_(value) << PAC_STATUSB_SDMMC1_Pos)) /* Assigment of value for SDMMC1 in the PAC_STATUSB register */
#define PAC_STATUSB_Msk                       _UINT32_(0x3F3FFFFF)                                 /* (PAC_STATUSB) Register Mask  */

#define PAC_STATUSB_SERCOM_Pos                _UINT32_(0)                                          /* (PAC_STATUSB Position) SERCOM9 APB Protect Enable */
#define PAC_STATUSB_SERCOM_Msk                (_UINT32_(0x1) << PAC_STATUSB_SERCOM_Pos)            /* (PAC_STATUSB Mask) SERCOM */
#define PAC_STATUSB_SERCOM(value)             (PAC_STATUSB_SERCOM_Msk & (_UINT32_(value) << PAC_STATUSB_SERCOM_Pos)) 
#define PAC_STATUSB_TCC_Pos                   _UINT32_(1)                                          /* (PAC_STATUSB Position) TCCx APB Protect Enable */
#define PAC_STATUSB_TCC_Msk                   (_UINT32_(0x3FF) << PAC_STATUSB_TCC_Pos)             /* (PAC_STATUSB Mask) TCC */
#define PAC_STATUSB_TCC(value)                (PAC_STATUSB_TCC_Msk & (_UINT32_(value) << PAC_STATUSB_TCC_Pos)) 
#define PAC_STATUSB_SPI_IXS_Pos               _UINT32_(14)                                         /* (PAC_STATUSB Position) SPI_IXSx APB Protect Enable */
#define PAC_STATUSB_SPI_IXS_Msk               (_UINT32_(0x3) << PAC_STATUSB_SPI_IXS_Pos)           /* (PAC_STATUSB Mask) SPI_IXS */
#define PAC_STATUSB_SPI_IXS(value)            (PAC_STATUSB_SPI_IXS_Msk & (_UINT32_(value) << PAC_STATUSB_SPI_IXS_Pos)) 
#define PAC_STATUSB_CAN_Pos                   _UINT32_(16)                                         /* (PAC_STATUSB Position) CANx APB Protect Enable */
#define PAC_STATUSB_CAN_Msk                   (_UINT32_(0x3F) << PAC_STATUSB_CAN_Pos)              /* (PAC_STATUSB Mask) CAN */
#define PAC_STATUSB_CAN(value)                (PAC_STATUSB_CAN_Msk & (_UINT32_(value) << PAC_STATUSB_CAN_Pos)) 
#define PAC_STATUSB_SQI_Pos                   _UINT32_(25)                                         /* (PAC_STATUSB Position) SQIx APB Protect Enable */
#define PAC_STATUSB_SQI_Msk                   (_UINT32_(0x3) << PAC_STATUSB_SQI_Pos)               /* (PAC_STATUSB Mask) SQI */
#define PAC_STATUSB_SQI(value)                (PAC_STATUSB_SQI_Msk & (_UINT32_(value) << PAC_STATUSB_SQI_Pos)) 
#define PAC_STATUSB_SDMMC_Pos                 _UINT32_(28)                                         /* (PAC_STATUSB Position) SDMMCx APB Protect Enable */
#define PAC_STATUSB_SDMMC_Msk                 (_UINT32_(0x3) << PAC_STATUSB_SDMMC_Pos)             /* (PAC_STATUSB Mask) SDMMC */
#define PAC_STATUSB_SDMMC(value)              (PAC_STATUSB_SDMMC_Msk & (_UINT32_(value) << PAC_STATUSB_SDMMC_Pos)) 

/* -------- PAC_STATUSC : (PAC Offset: 0x3C) ( R/ 32) Peripheral write protection status - Bridge C -------- */
#define PAC_STATUSC_RESETVALUE                _UINT32_(0x38)                                       /*  (PAC_STATUSC) Peripheral write protection status - Bridge C  Reset Value */

#define PAC_STATUSC_MLB_Pos                   _UINT32_(2)                                          /* (PAC_STATUSC) MLB APB Protect Enable Position */
#define PAC_STATUSC_MLB_Msk                   (_UINT32_(0x1) << PAC_STATUSC_MLB_Pos)               /* (PAC_STATUSC) MLB APB Protect Enable Mask */
#define PAC_STATUSC_MLB(value)                (PAC_STATUSC_MLB_Msk & (_UINT32_(value) << PAC_STATUSC_MLB_Pos)) /* Assigment of value for MLB in the PAC_STATUSC register */
#define PAC_STATUSC_Msk                       _UINT32_(0x00000004)                                 /* (PAC_STATUSC) Register Mask  */


/** \brief PAC register offsets definitions */
#define PAC_WRCTRL_REG_OFST            _UINT32_(0x00)      /* (PAC_WRCTRL) Write control Offset */
#define PAC_EVCTRL_REG_OFST            _UINT32_(0x04)      /* (PAC_EVCTRL) Event control Offset */
#define PAC_INTENCLR_REG_OFST          _UINT32_(0x08)      /* (PAC_INTENCLR) Interrupt enable clear Offset */
#define PAC_INTENSET_REG_OFST          _UINT32_(0x09)      /* (PAC_INTENSET) Interrupt enable set Offset */
#define PAC_INTFLAGAHB_REG_OFST        _UINT32_(0x10)      /* (PAC_INTFLAGAHB) Bridge interrupt flag status Offset */
#define PAC_INTFLAGA_REG_OFST          _UINT32_(0x14)      /* (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A Offset */
#define PAC_INTFLAGB_REG_OFST          _UINT32_(0x18)      /* (PAC_INTFLAGB) Peripheral interrupt flag status - Bridge B Offset */
#define PAC_INTFLAGC_REG_OFST          _UINT32_(0x1C)      /* (PAC_INTFLAGC) Peripheral interrupt flag status - Bridge C Offset */
#define PAC_STATUSA_REG_OFST           _UINT32_(0x34)      /* (PAC_STATUSA) Peripheral write protection status - Bridge A Offset */
#define PAC_STATUSB_REG_OFST           _UINT32_(0x38)      /* (PAC_STATUSB) Peripheral write protection status - Bridge B Offset */
#define PAC_STATUSC_REG_OFST           _UINT32_(0x3C)      /* (PAC_STATUSC) Peripheral write protection status - Bridge C Offset */

